app/controllers/tests/ajaxes_controller.rb

INSERT INTO "tests_ajaxes" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Seg, 24 Set 2012 03:10:23 UTC +00:00], ["description", nil], ["name", "1"], ["updated_at", Seg, 24 Set 2012 03:10:23 UTC +00:00]]
---
  def add
    respond_to do |format|
      format.json do
        puts format.html.to_yaml
        @ajax = Tests::Ajax.create!(name: (((Tests::Ajax.last ? Tests::Ajax.last.id : 0) + 1).to_s))