app/controllers/customers_controller.rb

  def new
    @person = CustomerPj.new
    @customer.person = @person
    @segments = BusinessSegment.all
---
SELECT "business_segments".* FROM "business_segments" ORDER BY business_segments.name