app/controllers/tasks_controller.rb

  def create
    @task = @customer.tasks.build(params[:task])

    @task.status = SystemTaskStatus.OPENED
    @task.user = current_user

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("assigned_id", "contact_id", "contact_type", "created_at", "description", "due_time", "finish_time", "interested_id", "interested_type", "name", "notes", "resolution_id", "status_id", "type_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"